# BoundaryXTranslationSpring Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BoundaryXTranslationSpring Property
ParameterTypeId Class See Also
---
"X Translation - Spring"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BoundaryXTranslationSpring { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BoundaryXTranslationSpring As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BoundaryXTranslationSpring {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace